<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"prod","backend":"42b4e24bf3915b0abcdec50d0e4734756189eb4214cd01044cd4e9fd59e7cdbb","plan_job_ref":"Job Tofu - Plan #72 at https://github.com/lancelot-prigent/toolbox/actions/runs/15948002639","plan_hash":"9559c2a98651c3d38ecdae649eb25c0cd0dbf627985ccf05ba5b357c2189c68c","plan_text_format":"diff","version":"2.1.0","plan_out_hash":"6e987abc903ae1af28d43e4c195f8392a9ddf70284b72c6de85bb7f7b5f4fd3a"} -->
OpenTofu plan for __prod__
<details>
<summary>Plan: 7 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.environment.module.api.github_actions_environment_variable.api_registry_endpoint will be created
+   resource "github_actions_environment_variable" "api_registry_endpoint" {
+       created_at    = (known after apply)
+       environment   = "prod"
+       id            = (known after apply)
+       repository    = "toolbox"
+       updated_at    = (known after apply)
+       value         = (known after apply)
+       variable_name = "API_REGISTRY_ENDPOINT"
    }

  # module.environment.module.api.scaleway_container.api will be created
+   resource "scaleway_container" "api" {
+       cpu_limit             = 70
+       cron_status           = (known after apply)
+       deploy                = true
+       domain_name           = (known after apply)
+       environment_variables = (known after apply)
+       error_message         = (known after apply)
+       http_option           = "redirected"
+       id                    = (known after apply)
+       local_storage_limit   = (known after apply)
+       max_concurrency       = (known after apply)
+       max_scale             = 1
+       memory_limit          = 128
+       min_scale             = 0
+       name                  = "prod-toolbox-api"
+       namespace_id          = (known after apply)
+       port                  = 80
+       privacy               = "public"
+       protocol              = "http1"
+       region                = (known after apply)
+       registry_image        = "traefik/whoami:latest"
+       sandbox               = (known after apply)
+       status                = (known after apply)
+       timeout               = (known after apply)
    }

  # module.environment.module.api.scaleway_container_namespace.api will be created
+   resource "scaleway_container_namespace" "api" {
+       activate_vpc_integration = false
+       destroy_registry         = false
+       id                       = (known after apply)
+       name                     = "prod-toolbox-ns-api"
+       organization_id          = (known after apply)
+       project_id               = (known after apply)
+       region                   = (known after apply)
+       registry_endpoint        = (known after apply)
+       registry_namespace_id    = (known after apply)
    }

  # module.environment.module.api.scaleway_iam_application.api will be created
+   resource "scaleway_iam_application" "api" {
+       created_at      = (known after apply)
+       description     = "IAM application for the API"
+       editable        = (known after apply)
+       id              = (known after apply)
+       name            = "prod-toolbox-api"
+       organization_id = (known after apply)
+       updated_at      = (known after apply)
    }

  # module.environment.module.api.scaleway_iam_policy.main_rw will be created
+   resource "scaleway_iam_policy" "main_rw" {
+       application_id  = (known after apply)
+       created_at      = (known after apply)
+       description     = "Policy to allow read and write access to the main database"
+       editable        = (known after apply)
+       id              = (known after apply)
+       name            = "prod-toolbox-db-main-rw-policy"
+       organization_id = (known after apply)
+       updated_at      = (known after apply)

+       rule {
+           permission_set_names = [
+               "ServerlessSQLDatabaseReadWrite",
            ]
+           project_ids          = (known after apply)
        }
    }

  # module.environment.module.api.scaleway_sdb_sql_database.main will be created
+   resource "scaleway_sdb_sql_database" "main" {
+       endpoint   = (known after apply)
+       id         = (known after apply)
+       max_cpu    = 1
+       min_cpu    = 0
+       name       = "prod-toolbox-db-main"
+       project_id = (known after apply)
+       region     = (known after apply)
    }

  # module.environment.module.scaleway_project.scaleway_account_project.project will be created
+   resource "scaleway_account_project" "project" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       name            = "prod-toolbox"
+       organization_id = (known after apply)
+       updated_at      = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   api_container_endpoint = (known after apply)
```
</details>

:memo: Plan generated in [Tofu - Plan #72](https://github.com/lancelot-prigent/toolbox/actions/runs/15948002639)